zephyrproject-rtos/hal_microchip/sam/sam_d5x_e5x/atsame53/include/component/oscctrl.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/* DPLL register API structure */
typedef struct
{
  __IO  uint8_t                        OSCCTRL_DPLLCTRLA;  /* Offset: 0x00 (R/W  8) DPLL Control A */
  __I   uint8_t                        Reserved1[0x03];
  __IO  uint32_t                       OSCCTRL_DPLLRATIO;  /* Offset: 0x04 (R/W  32) DPLL Ratio Control */
  __IO  uint32_t                       OSCCTRL_DPLLCTRLB;  /* Offset: 0x08 (R/W  32) DPLL Control B */
  __I   uint32_t                       OSCCTRL_DPLLSYNCBUSY; /* Offset: 0x0C (R/   32) DPLL Synchronization Busy */
  __I   uint32_t                       OSCCTRL_DPLLSTATUS; /* Offset: 0x10 (R/   32) DPLL Status */
} oscctrl_dpll_registers_t;

#define OSCCTRL_DPLL_NUMBER 2

/* OSCCTRL register API structure */
typedef struct
{  /* Oscillators Control */
  __IO  uint8_t                        OSCCTRL_EVCTRL;     /* Offset: 0x00 (R/W  8) Event Control */
  __I   uint8_t                        Reserved1[0x03];
  __IO  uint32_t                       OSCCTRL_INTENCLR;   /* Offset: 0x04 (R/W  32) Interrupt Enable Clear */
  __IO  uint32_t                       OSCCTRL_INTENSET;   /* Offset: 0x08 (R/W  32) Interrupt Enable Set */
  __IO  uint32_t                       OSCCTRL_INTFLAG;    /* Offset: 0x0C (R/W  32) Interrupt Flag Status and Clear */
  __I   uint32_t                       OSCCTRL_STATUS;     /* Offset: 0x10 (R/   32) Status */
  __IO  uint32_t                       OSCCTRL_XOSCCTRL[2]; /* Offset: 0x14 (R/W  32) External Multipurpose Crystal Oscillator Control */
  __IO  uint8_t                        OSCCTRL_DFLLCTRLA;  /* Offset: 0x1C (R/W  8) DFLL48M Control A */
  __I   uint8_t                        Reserved2[0x03];
  __IO  uint8_t                        OSCCTRL_DFLLCTRLB;  /* Offset: 0x20 (R/W  8) DFLL48M Control B */
  __I   uint8_t                        Reserved3[0x03];
  __IO  uint32_t                       OSCCTRL_DFLLVAL;    /* Offset: 0x24 (R/W  32) DFLL48M Value */
  __IO  uint32_t                       OSCCTRL_DFLLMUL;    /* Offset: 0x28 (R/W  32) DFLL48M Multiplier */
  __IO  uint8_t                        OSCCTRL_DFLLSYNC;   /* Offset: 0x2C (R/W  8) DFLL48M Synchronization */
  __I   uint8_t                        Reserved4[0x03];
        oscctrl_dpll_registers_t       DPLL[OSCCTRL_DPLL_NUMBER]; /* Offset: 0x30  */
} oscctrl_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAME53_OSCCTRL_COMPONENT_H_ */
